*Tasks
** DONE Estimated annual mileage
** DONE Tank mpg
** TODO Comulatiive mileage
** TODO Add all data


| Date         | Mileage | Quantity |  Cost | Estimated contract mileage |                        Tank mpg | Cumulative mpg |
|--------------+---------+----------+-------+----------------------------+---------------------------------+----------------|
| <2016-06-13> |      24 |       37 |     0 |                       8760 | 2.9488151 - Mileage / 8.1388622 |      1.5451942 |
| <2016-06-17> |     426 |    33.61 | 37.95 |                      31098 |                       54.374537 |      57.620778 |
| <2016-06-20> |     683 |    22.12 | 24.97 |                  31161.875 |                       52.818496 |      55.714686 |
| <2016-06-24> |    1134 |    36.69 | 41.42 |                    34492.5 |                       55.881346 |      55.780849 |
| <2016-06-30> |    1577 |    36.95 | 40.61 |                  31978.056 |                       54.503867 |      55.416124 |
| <2016-07-06> |    2063 |    39.71 | 44.83 |                  31374.792 |                       55.638372 |      55.468321 |
| <2016-07-09> |    2386 |    25.58 | 28.88 |                  32255.185 |                       57.403717 |      55.722648 |
| <2016-07-12> |    2783 |       32 |    24 |                  33859.833 |                       56.399929 |      55.818267 |
| <2016-07-18> |    3273 |    42.25 | 47.28 |                  33184.583 |                       52.723884 |      55.332091 |
| <2016-07-22> |    3609 |    27.60 |    32 |                  32932.125 |                       55.343704 |      55.333172 |
| <2016-07-27> |    4147 |    44.04 | 50.23 |                  33636.778 |                       55.535795 |      55.359375 |
| <2016-07-29> |    4313 |    13.45 |    16 |                  33494.574 |                       56.107877 |      55.387814 |
| <2016-08-04> |    4858 |    44.97 | 50.21 |                  33456.038 |                       55.094931 |      55.354802 |
| <2016-08-07> |    5194 |    30.79 | 34.45 |                   33853.75 |                       49.609816 |      54.943204 |
| <2016-08-10> |         |    40.49 | 44.90 |                          0 |                      -583.16600 |             0. |
| <2016-08-12> |    5808 |    10.65 | 11.81 |                  34752.787 |                       2479.2198 |      54.904743 |
| <2016-08-15> |    6312 |    40.79 | 46.33 |                  35998.125 |                       56.171350 |      55.003776 |
| <2016-08-20> |    6821 |    43.66 | 50.18 |                  36082.101 |                       52.999538 |      54.848996 |
| <2016-08-26> |    7332 |    42.24 | 48.53 |                    35682.4 |                       54.996496 |      54.859250 |
| <2016-09-04> |    7874 |    43.43 | 49.03 |                  34214.405 |                       56.734533 |      54.984352 |
| <2016-09-16> |    8404 |    44.22 | 42.68 |                  31952.708 |                       54.487284 |      54.952736 |
| <2016-09-25> |    8932 |    41.62 | 51.15 |                  31049.333 |                       57.672646 |      55.106365 |
| <2016-10-03> |    9425 |    41.46 | 47.64 |                  30443.584 |                       54.057462 |      55.050491 |
| <2016-10-10> |    9968 |    34.32 | 35.85 |                  30319.333 |                       71.926774 |      55.763222 |
| <2016-10-13> |   10406 |          |       |                  30879.593 |                        438 / 0. |      58.213492 |
| <2016-10-19> |   10909 |    43.70 | 53.52 |                  30866.550 |                       52.326848 |      57.913090 |
| <2016-10-25> |   11423 |       42 |    45 |                  30884.407 |                       55.635482 |      57.806606 |
#+TBLFM: $5=365 * $2 / ($1-@2$1+1)::$6=($2-@-1$2)/($3 / 4.54609)::$7=$2 / (vsum(@3$3..@$3) / 4.54609)
